{
  "entity_tokens": [
    "agent",
    "approval",
    "arrival",
    "chat",
    "formula",
    "inventory",
    "job",
    "location",
    "machine",
    "material",
    "process",
    "product",
    "proposal",
    "slot",
    "step",
    "storage",
    "transaction",
    "type"
  ],
  "generic_threshold": 0.6,
  "generic_tokens": [
    "data",
    "error",
    "id",
    "success"
  ],
  "known_tool_tokens": [
    "0",
    "1",
    "2",
    "4",
    "7",
    "a",
    "action",
    "active",
    "actual",
    "add",
    "agent",
    "agnostic",
    "ahead",
    "ai",
    "alert",
    "all",
    "allocat",
    "allocation",
    "allow",
    "alternative",
    "ambiguou",
    "an",
    "analysi",
    "and",
    "app",
    "appli",
    "apply",
    "approval",
    "approve",
    "arg",
    "array",
    "arrival",
    "arrivalid",
    "arrive",
    "asc",
    "assign",
    "assignment",
    "assist",
    "assistant",
    "at",
    "auto",
    "available",
    "availablefrom",
    "backfill",
    "backward",
    "basi",
    "batch",
    "batche",
    "bay",
    "bdi",
    "before",
    "belief",
    "block",
    "body",
    "bom",
    "bomid",
    "bottleneck",
    "buffer",
    "bullet",
    "bundle",
    "business",
    "buy",
    "by",
    "calendar",
    "call",
    "cancel",
    "cancell",
    "candidate",
    "capability",
    "capabilityid",
    "capacity",
    "capacityperhour",
    "card",
    "cause",
    "chang",
    "change",
    "changeover",
    "chat",
    "chatbot",
    "check",
    "clarification",
    "clean",
    "clear",
    "cnc",
    "coat",
    "cold",
    "collection",
    "command",
    "commit",
    "committ",
    "compat",
    "complet",
    "complete",
    "completion",
    "component",
    "componenttype",
    "composition",
    "comput",
    "confidence",
    "constraint",
    "consum",
    "consume",
    "content",
    "contract",
    "conversation",
    "cool",
    "count",
    "creat",
    "create",
    "createdat",
    "current",
    "currentstock",
    "dashboard",
    "data",
    "dataset",
    "date",
    "day",
    "db",
    "deadline",
    "debug",
    "decision",
    "default",
    "defaultchangeovertime",
    "defaultcleaningtime",
    "defaultsetuptime",
    "defect",
    "defectcount",
    "definition",
    "delay",
    "delete",
    "demand",
    "desc",
    "description",
    "desire",
    "detail",
    "deviation",
    "dir",
    "display",
    "dock",
    "downtime",
    "downtimeid",
    "downtimeminute",
    "dry",
    "duplicate",
    "dur",
    "duration",
    "durationminute",
    "e",
    "earliest",
    "edd",
    "effect",
    "effectivefrom",
    "effectiveto",
    "efficiency",
    "efficiencyfactor",
    "emit",
    "empty",
    "enabl",
    "end",
    "endtime",
    "entity",
    "epo",
    "error",
    "estimate",
    "etc",
    "event",
    "exclude",
    "execut",
    "executable",
    "execute",
    "execution",
    "exist",
    "expect",
    "expectedarriveat",
    "explanation",
    "explicit",
    "explode",
    "explosion",
    "export",
    "f",
    "factor",
    "factory",
    "fail",
    "false",
    "fetch",
    "field",
    "fifo",
    "filter",
    "floor",
    "for",
    "forecast",
    "form",
    "formula",
    "formulaid",
    "formulaname",
    "from",
    "g",
    "gap",
    "generat",
    "generate",
    "generation",
    "get",
    "group",
    "guidance",
    "hand",
    "hazardou",
    "hidden",
    "high",
    "holiday",
    "hour",
    "hrs",
    "human",
    "icon",
    "id",
    "idempotency",
    "idle",
    "ids",
    "if",
    "in",
    "include",
    "index",
    "infer",
    "ingredient",
    "inline",
    "input",
    "insight",
    "inspection",
    "inspectionid",
    "inspectiontime",
    "inspector",
    "inspectorname",
    "instant",
    "instruction",
    "integration",
    "intent",
    "intention",
    "interval",
    "inventory",
    "inventoryid",
    "is",
    "isprimary",
    "issue",
    "item",
    "job",
    "jobid",
    "jobstepid",
    "jobstepslotid",
    "json",
    "key",
    "kg",
    "kind",
    "kpi",
    "label",
    "language",
    "last",
    "lastmaintenancedate",
    "lastupdat",
    "late",
    "lateness",
    "lead",
    "length",
    "level",
    "limit",
    "link",
    "list",
    "liter",
    "location",
    "lock",
    "log",
    "lookup",
    "low",
    "m",
    "machine",
    "machineid",
    "machinename",
    "machinetype",
    "maintenance",
    "maintenanceid",
    "maintenanceintervalday",
    "maintenancetype",
    "make",
    "map",
    "mat",
    "match",
    "matche",
    "material",
    "materialid",
    "materialname",
    "max",
    "measure",
    "medium",
    "message",
    "metadata",
    "method",
    "metric",
    "min",
    "minimum",
    "minstock",
    "minute",
    "mode",
    "model",
    "modifier",
    "multiple",
    "mutable",
    "mutation",
    "name",
    "need",
    "neededat",
    "new",
    "next",
    "no",
    "normal",
    "not",
    "note",
    "notification",
    "objective",
    "obsolete",
    "oee",
    "of",
    "offline",
    "offset",
    "omit",
    "omitt",
    "on",
    "only",
    "op",
    "operation",
    "operator",
    "operatornote",
    "option",
    "optional",
    "optiontype",
    "or",
    "order",
    "out",
    "outcome",
    "output",
    "overlap",
    "override",
    "p",
    "pagination",
    "parallel",
    "parent",
    "parse",
    "pass",
    "patch",
    "path",
    "pau",
    "pause",
    "payload",
    "pcs",
    "pct",
    "penalty",
    "pend",
    "per",
    "percent",
    "percentage",
    "persist",
    "plann",
    "planner",
    "post",
    "prc",
    "predecessor",
    "predictive",
    "prefix",
    "prep",
    "preparation",
    "press",
    "preview",
    "primary",
    "priority",
    "process",
    "processid",
    "processname",
    "produc",
    "product",
    "productcomponentid",
    "productid",
    "production",
    "productionid",
    "productname",
    "producttype",
    "propo",
    "proposal",
    "provid",
    "public",
    "purpose",
    "put",
    "q",
    "qty",
    "quality",
    "quantity",
    "quantityonhand",
    "quantityperunit",
    "quantityproduc",
    "quantityrequir",
    "quantityreserv",
    "quantityscrap",
    "query",
    "rack",
    "rank",
    "rate",
    "read",
    "readable",
    "readiness",
    "readonly",
    "receiv",
    "receive",
    "receivedat",
    "recipe",
    "recommendation",
    "record",
    "ref",
    "reference",
    "referencejobid",
    "refresh",
    "reject",
    "relea",
    "reorder",
    "reorderlevel",
    "replan",
    "replenish",
    "replenishment",
    "report",
    "request",
    "requir",
    "require",
    "reroute",
    "reschedule",
    "reserv",
    "reservation",
    "reservationid",
    "reservedqty",
    "resource",
    "result",
    "resume",
    "retrieve",
    "return",
    "rfc3339",
    "risk",
    "role",
    "rout",
    "row",
    "run",
    "runn",
    "s",
    "safety",
    "safetynote",
    "schedul",
    "schedule",
    "scope",
    "score",
    "scrap",
    "scraprate",
    "secondary",
    "selection",
    "selector",
    "send",
    "sequence",
    "set",
    "sett",
    "setting",
    "setup",
    "severity",
    "shelf",
    "shortage",
    "side",
    "since",
    "single",
    "size",
    "slack",
    "slot",
    "slotid",
    "snapshot",
    "solver",
    "sort",
    "source",
    "spe",
    "specific",
    "split",
    "splitt",
    "stag",
    "start",
    "starttime",
    "stat",
    "state",
    "status",
    "step",
    "stepid",
    "stepsequence",
    "stock",
    "storage",
    "storagelocation",
    "strategy",
    "sub",
    "subproduct",
    "success",
    "suggest",
    "suggestion",
    "summary",
    "support",
    "target",
    "technician",
    "the",
    "theme",
    "thi",
    "tied",
    "time",
    "title",
    "to",
    "tone",
    "tool",
    "total",
    "train",
    "transaction",
    "transfer",
    "transport",
    "trend",
    "true",
    "turn",
    "type",
    "ui",
    "unit",
    "unitofmeasure",
    "unschedul",
    "updat",
    "update",
    "updatedat",
    "urgent",
    "use",
    "user",
    "utilization",
    "utilizationrate",
    "v1",
    "validat",
    "validate",
    "value",
    "verify",
    "version",
    "vs",
    "wait",
    "weight",
    "when",
    "window",
    "with",
    "without",
    "work",
    "write",
    "x",
    "zero",
    "zone"
  ],
  "operator_tokens": [
    "a",
    "about",
    "all",
    "an",
    "and",
    "any",
    "by",
    "can",
    "check",
    "create",
    "delete",
    "find",
    "for",
    "from",
    "get",
    "give",
    "help",
    "in",
    "into",
    "list",
    "lookup",
    "me",
    "new",
    "of",
    "please",
    "read",
    "remove",
    "show",
    "the",
    "to",
    "update",
    "view",
    "with"
  ],
  "source": "C:\\Users\\dilun\\OneDrive\\Documents\\eMas APi\\emas\\docs\\swagger.json",
  "tool_count": 138
}
